Project/Toir/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВыявленныеДефекты</name>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_СостоянияОбъектовРемонта</basedOn>
  <basedOn>Document.торо_УчетКонтролируемыхПоказателей</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Влияние</name>
    <type>
      <types>EnumRef.гкс_Влияние</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДефектОформленПоТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НарядЗаданиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <comment>TOIR20-576</comment>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОписаниеДефектаСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СпециализацияТехническогоСпециалиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СрочностьВоздействия</name>
    <comment>8220 Тарасов</comment>
    <type>
      <types>EnumRef.гкс_СрочностьВоздействия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_IDОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.торо_ВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйОбъект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СимптомДефекта</name>
      <type>
        <types>CatalogRef.гкс_СимптомыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_КорневаяПричина</name>
      <type>
        <types>CatalogRef.гкс_КорневыеПричины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныеЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <attributes>
      <name>ID_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ФайлыФиксации</name>
    <comment>TOIR20-598</comment>
    <attributes>
      <name>НаименованиеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ВыявленныеДефекты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Дефектная ведомость
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты";
	КомандаПечати.Идентификатор = "ДефектнаяВедомость";
	КомандаПечати.Представление = НСтр("es='El registro defectuoso';ru='Дефектная ведомость';en='Defective statement'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Дефектная ведомость (ликвидация ОР)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты";
	КомандаПечати.Идентификатор = "ДефектнаяВедомостьЛиквидация";
	КомандаПечати.Представление = НСтр("es='El registro defectuoso (la liquidación ОР)';ru='Дефектная ведомость (ликвидация ОР)';en='Defective statement (liquidation of PR)'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Акт дефектации
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты";
	КомандаПечати.Идентификатор = "АктДефектации";
	КомандаПечати.Представление = НСтр("es='El informe sobre los defectos detectados';ru='Акт дефектации';en='Act of detection'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Журнал дефектов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты";
	КомандаПечати.Идентификатор = "ЖурналДефектов";
	КомандаПечати.Представление = НСтр("es='La revista de los defectos';ru='Журнал дефектов';en='Defect log'");
	КомандаПечати.Обработчик = "торо_Печать.ОткрытьФормуЖурналаДефектов";
	
	// Акт рекламации 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты";
	КомандаПечати.Идентификатор = "РекламационныйАкт";
	КомандаПечати.Обработчик = "торо_Печать.ВыбратьГарантийныеРемонтыДляПечати";
	КомандаПечати.Представление = НСтр("es='El acta de reclamación';ru='Рекламационный акт';en='Reclamation act'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДефектнаяВедомостьЛиквидация") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ДефектнаяВедомостьЛиквидация", 
		"Дефектная ведомость (ликвидация ОР)", 
		ПечатьДефектнойВедомостиЛиквидации(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомостьЛиквидация");
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДефектнаяВедомость") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ДефектнаяВедомость", 
		"Дефектная ведомость", 
		ПечатьДефектнойВедомости(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");	
		
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктДефектации") Тогда
		
		ПараметрыПечати.Вставить("ПечатьАктаДефектации");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"АктДефектации", 
		"Акт дефектации", 
		ПечатьАктаДефектации(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ВыявленныеДефекты.ПФ_MXL_АктДефектации");
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РекламационныйАкт") Тогда
		
		ПараметрыПечати.Вставить("ПечатьРекламационногоАкта");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"РекламационныйАкт", 
		"Рекламационный акт", 
		ПечатьРекламационногоАкта(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ВыявленныеДефекты.ПФ_MXL_РекламационныйАкт");
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПечатьДефектнойВедомости(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	// >> [Деснол] [Ушаков А.Д.] [16.09.2019] 
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");
	Макет = торо_Локализация.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");
	// << [Деснол] [Ушаков А.Д.] [16.09.2019] 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка,
	|	торо_ВыявленныеДефекты.Номер КАК Номер,
	|	торо_ВыявленныеДефекты.Дата КАК Дата,
	|	торо_ВыявленныеДефекты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	торо_ВыявленныеДефекты.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|	торо_ВыявленныеДефекты.Организация КАК Организация,
	|	торо_ВыявленныеДефекты.Подразделение КАК Подразделение,
	|	торо_ВыявленныеДефекты.Ответственный КАК Ответственный,
	|	торо_ВыявленныеДефекты.Инициатор КАК Инициатор,
	|	торо_ВыявленныеДефекты.СписокДефектов.(
	|		ВидДефекта КАК ВидДефекта,
	|		ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|		ДефектОписание КАК ДефектОписание,
	|		ДефектПричина КАК ДефектПричина,
	|		НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|		ОбъектРемонта КАК ОбъектРемонта,
	|		ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|		ПоследствияДефекта КАК ПоследствияДефекта,
	|		КритичностьДефекта КАК КритичностьДефекта,
	|		КрайняяДопустимаяДатаЗавершенияРемонта КАК КрайняяДопустимаяДатаЗавершенияРемонта,
	|		ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	|		ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
	|	) КАК СписокДефектов
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	ЭтоПервый = Истина;
	
	ФОНазначениеНаРемонтСУчетомРисков = ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков");

	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ШапкаДокумента                 = Макет.ПолучитьОбласть("ШапкаДокумента");
		
		Если ФОНазначениеНаРемонтСУчетомРисков Тогда
			
			ШапкаДокументаЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаДокументаЗаголовокТаблицыМОР");
			СтрокаТаблицаНомераКолонок     = Макет.ПолучитьОбласть("СтрокаТаблицаНомераКолонокМОР");
			СтрокаТаблицыОР                = Макет.ПолучитьОбласть("СтрокаТаблицыОРМОР");
			СтрокаТаблицаОтказавшийЭлемент = Макет.ПолучитьОбласть("СтрокаТаблицаОтказавшийЭлементМОР");
	
		Иначе
			
			ШапкаДокументаЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаДокументаЗаголовокТаблицы");
			СтрокаТаблицаНомераКолонок     = Макет.ПолучитьОбласть("СтрокаТаблицаНомераКолонок");
			СтрокаТаблицыОР                = Макет.ПолучитьОбласть("СтрокаТаблицыОР");
			СтрокаТаблицаОтказавшийЭлемент = Макет.ПолучитьОбласть("СтрокаТаблицаОтказавшийЭлемент");
			
		КонецЕсли; 
		
		ПодвалОтветственные            = Макет.ПолучитьОбласть("ПодвалОтветственные");
		
		ШапкаДокумента.Параметры.НомерДокумента           = ВыборкаДокументов.Номер;
		ШапкаДокумента.Параметры.ДатаДокумента            = ВыборкаДокументов.Дата;
		ШапкаДокумента.Параметры.Подразделение            = ВыборкаДокументов.Подразделение;
		ШапкаДокумента.Параметры.Организация              = ВыборкаДокументов.Организация;
		ШапкаДокумента.Параметры.ДатаОбнаружения          = ВыборкаДокументов.ДатаОбнаружения; 
		ШапкаДокумента.Параметры.ДефектВыявленВПроцессе   = ВыборкаДокументов.ДефектВыявленВПроцессе; 
		ШапкаДокумента.Параметры.Инициатор                = ВыборкаДокументов.Инициатор; 	
		
		ТабДок.Вывести(ШапкаДокумента);	
		
		ТабДок.Вывести(ШапкаДокументаЗаголовокТаблицы);		
		
		ТабДок.Вывести(СтрокаТаблицаНомераКолонок);
		ГруппаОтказавшихЭлементов=Неопределено;
		ном=1;
		
		ТЧДефектов = ВыборкаДокументов.СписокДефектов.Выгрузить();
		
		Для Каждого Дефект Из ТЧДефектов Цикл
			ОбъектРемонтаИзТЧ = Дефект.ОбъектРемонта;
			
			Если не (ОбъектРемонтаИзТЧ = ГруппаОтказавшихЭлементов) или (ГруппаОтказавшихЭлементов=Неопределено) Тогда 
				СтрокаТаблицыОР.Параметры.ОбъектРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектРемонтаИзТЧ);
				
				ТабДок.Вывести(СтрокаТаблицыОР);
				ГруппаОтказавшихЭлементов= ОбъектРемонтаИзТЧ;
			КонецЕсли;
			
			СтрокаТаблицаОтказавшийЭлемент.Параметры.н = ном;
	        СтрокаТаблицаОтказавшийЭлемент.Параметры.ОтказавшийЭлемент = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Дефект.ОтказавшийЭлемент);
            СтрокаТаблицаОтказавшийЭлемент.Параметры.ВидДефекта             = Дефект.ВидДефекта;
            СтрокаТаблицаОтказавшийЭлемент.Параметры.ОписаниеДефекта        = Дефект.ДефектОписание;
            СтрокаТаблицаОтказавшийЭлемент.Параметры.ПричинаДефекта         = Дефект.ДефектПричина;
            СтрокаТаблицаОтказавшийЭлемент.Параметры.УстранениеДефекта      = Дефект.НаправлениеНаУстранение;
            СтрокаТаблицаОтказавшийЭлемент.Параметры.ПоследствияДефекта     = Дефект.ПоследствияДефекта;
            
            Если ФОНазначениеНаРемонтСУчетомРисков Тогда
				
				СтрокаТаблицаОтказавшийЭлемент.Параметры.ДатаНачала         = Дефект.ДатаНачалаРемонта;
                СтрокаТаблицаОтказавшийЭлемент.Параметры.ДатаОкончания      = Дефект.ДатаОкончанияРемонта;
                СтрокаТаблицаОтказавшийЭлемент.Параметры.КДДЗР              = Дефект.КрайняяДопустимаяДатаЗавершенияРемонта;
	
			КонецЕсли; 
			
			ном = ном + 1;
			
			ТабДок.Вывести(СтрокаТаблицаОтказавшийЭлемент);
		КонецЦикла;
		
		ПодвалОтветственные.Параметры.Ответственный = ВыборкаДокументов.Ответственный;
		ТабДок.Вывести(ПодвалОтветственные);
		
	КонецЦикла;
	
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр      = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДок;
	
	
КонецФункции

Функция ПечатьДефектнойВедомостиЛиквидации(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомостьЛиквидация");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка,
	|	торо_ВыявленныеДефекты.Номер КАК Номер,
	|	торо_ВыявленныеДефекты.Дата КАК Дата,
	|	торо_ВыявленныеДефекты.Организация КАК Организация,
	|	торо_ВыявленныеДефекты.Подразделение КАК Подразделение,
	|	торо_ВыявленныеДефекты.СписокДефектов.(
	|		ДефектОписание КАК ДефектОписание,
	|		ОбъектРемонта КАК ОбъектРемонта,
	|		ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|		ОбъектРемонта.ИнвентарныйНомер КАК ОбъектРемонтаИнвентарныйНомер,
	|		ОбъектРемонта.ДатаВводаВЭксплуатацию КАК ОбъектРемонтаДатаВводаВЭксплуатацию
	|	) КАК СписокДефектов
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		СтрокаТаблицаНомераКолонок = Макет.ПолучитьОбласть("СтрокаТаблицаНомераКолонок");
		СтрокаТаблицаОткозавшийЭлемент = Макет.ПолучитьОбласть("СтрокаТаблицаОткозавшийЭлемент");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ШапкаДокумента.Параметры.НомерДокумента 	= ВыборкаДокументов.Номер;
		ШапкаДокумента.Параметры.ДатаДокумента 	= Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
		ШапкаДокумента.Параметры.Подразделение 	= ВыборкаДокументов.Подразделение;
		ШапкаДокумента.Параметры.Организация 		= ВыборкаДокументов.Организация;
		
		ТабДок.Вывести(ШапкаДокумента);
		ТабДок.Вывести(СтрокаТаблицаНомераКолонок);
		ном=1;
		
		ТЧДефектов = ВыборкаДокументов.СписокДефектов.Выгрузить();
		
		Для Каждого Дефект Из ТЧДефектов Цикл
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаОткозавшийЭлемент.Параметры, Дефект.ОбъектРемонта);
			СтрокаТаблицаОткозавшийЭлемент.Параметры.н = ном;
			СтрокаТаблицаОткозавшийЭлемент.Параметры.ОбъектРемонта 	 = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Дефект.ОбъектРемонта);
			СтрокаТаблицаОткозавшийЭлемент.Параметры.ИнвНомер     	 = Дефект.ОбъектРемонтаИнвентарныйНомер;
			СтрокаТаблицаОткозавшийЭлемент.Параметры.ДатаВвода	  	 = Формат(Дефект.ОбъектРемонтаДатаВводаВЭксплуатацию,"ДФ=dd.MM.yyyy");
			СтрокаТаблицаОткозавшийЭлемент.Параметры.ОписаниеДефекта = ?(Дефект.ОбъектРемонта = Дефект.ОтказавшийЭлемент, Дефект.ДефектОписание, Строка(торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Дефект.ОтказавшийЭлемент))+", "+Дефект.ДефектОписание);
			
			ном=ном+1;
			
			ТабДок.Вывести(СтрокаТаблицаОткозавшийЭлемент);
			
		КонецЦикла;
		
		ТабДок.Вывести(Подвал);
		
	КонецЦикла;
	
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр      = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;

КонецФункции // ПечатьДефектнойВедомостиЛиквидации(МассивОбъектов, ПараметрыПечати)  ,

Функция ПечатьАктаДефектации(МассивОбъектов, ПараметрыПечати)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_АктДефектации");
	ТабДокумент = Новый ТабличныйДокумент;

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	|	торо_ВыявленныеДефектыСписокДефектов.НомерСтроки КАК НомерСтроки,
	|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ДефектПричина,
	|	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта КАК ПоследствияДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ВидРемонтов КАК ВидРемонтов,
	|	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ТиповойДефект КАК ТиповойДефект,
	|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
	|	торо_ВыявленныеДефектыСписокДефектов.ЗакрываетПредписание КАК ЗакрываетПредписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ДокументИсточник КАК ДокументИсточник,
	|	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	|	торо_ВыявленныеДефектыСписокДефектов.ГарантийныйРемонт КАК ГарантийныйРемонт,
	|	торо_ВыявленныеДефектыСписокДефектов.ГарантийныйОбъект КАК ГарантийныйОбъект
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|	И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, "И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	
	ВыборкаДокументов = ЗапросДокументов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Дефект = ВыборкаДокументов.Ссылка;
		ВыборкаКомиссия = ПолучитьКомиссию(Дефект);
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаРемонтов.Следующий() Цикл
			Если НЕ ЭтоПервый Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			ОР = ВыборкаРемонтов.ОбъектРемонта;
			
			// Выводим общие реквизиты шапки	
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Организация 		= Дефект.Организация;
			ОбластьМакета.Параметры.ОбъектРемонта 		= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
			ОбластьМакета.Параметры.НомерДокумента 		= Дефект.Номер;
			ОбластьМакета.Параметры.ДатаДокумента 		= Дефект.Дата;
			
			ОбластьМакета.Параметры.СтанционныйНомер 	= СокрЛП(ОР.ИнвентарныйНомер);
			//ОбластьМакета.Параметры.ДатаАкта 			= Дефект.Дата;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Комиссиия
			ВывестиКомиссию(ТабДокумент, ВыборкаКомиссия, Макет);
							
			// Выводим пункты 1, 2,3
			ОбластьМакета =  Макет.ПолучитьОбласть("Пункты_1_2_3");
			ОбластьМакета.Параметры.ОбъектРемонта 				= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
			ОбластьМакета.Параметры.СтанционныйНомер 			= СокрЛП(ОР.ИнвентарныйНомер);
			ОбластьМакета.Параметры.ЗаводИзготовитель 			= СокрЛП(?(ЗначениеЗаполнено(ОР.Изготовитель), ОР.Изготовитель, ОР.ТиповойОР.Изготовитель));
			ОбластьМакета.Параметры.ТипОборудования 			= СокрЛП(ОР.ТиповойОР);
			ОбластьМакета.Параметры.ЗаводскойНомер 				= СокрЛП(ОР.ЗаводскойНомер);
			ОбластьМакета.Параметры.ДатаВыпуска 				= ОР.ДатаВыпуска;
			ОбластьМакета.Параметры.ДатаВводаВЭксплуатацию 		= ОР.ДатаВводаВЭксплуатацию;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	торо_Ремонты.ID КАК ID,
			               |	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт
			               |ПОМЕСТИТЬ Цепочка
			               |ИЗ
			               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
			               |ГДЕ
			               |	торо_Ремонты.ОбъектРемонта = &ОбъектРемонта
			               |	И торо_Ремонты.ВидРемонта.КапитальныйРемонт = ИСТИНА
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	торо_Ремонты.ДатаНачалаФакт УБЫВ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	торо_Ремонты.ID КАК ID,
			               |	Цепочка.ДатаНачалаФакт КАК ДатаНачалаФакт,
			               |	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан
			               |ИЗ
			               |	Цепочка КАК Цепочка
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
			               |		ПО Цепочка.ID = торо_Ремонты.ID
			               |ГДЕ
			               |	торо_Ремонты.ДатаОкончанияПлан <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Запрос.УстановитьПараметр("ОбъектРемонта", ОР.Ссылка);
			Результат = Запрос.Выполнить().Выбрать();
			Пока Результат.Следующий() Цикл
				ОбластьМакета.Параметры.ДатаМесяцНачалаКапРемонта 	= Формат(Результат.ДатаНачалаФакт, "ДФ=дд") + "." + Формат(Результат.ДатаНачалаФакт, "ДФ=ММ");
				ОбластьМакета.Параметры.ГодНачалаКапРемонта 		= Формат(Результат.ДатаНачалаФакт, "ДФ=гг");
				ОбластьМакета.Параметры.ГодОкончанияКапРемонта 		= Формат(Результат.ДатаОкончанияПлан, "ДФ=гг");
			КонецЦикла;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим описание дефектов
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДеффектов");
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			СтрокаОписания = ВыборкаРемонтов.ДефектОписание + НСтр("ru=' элемента ';en='element';es=' of element '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			//СтрокаОписания = ВыборкаРемонтов.ДефектОписание + " элемента " + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьМакета.Параметры.ОписаниеДеффекта = СокрЛП(СтрокаОписания);	
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим пункт 4	
			ОбластьМакета =  Макет.ПолучитьОбласть("Пункт_4");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРабот");
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			СтрокаОписания = ВыборкаРемонтов.НаправлениеНаУстранение + НСтр("ru=' элемента ';en='element';es=' of element '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			//СтрокаОписания = ВыборкаРемонтов.НаправлениеНаУстранение + " элемента " + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьМакета.Параметры.ОписаниеРаботы = СокрЛП(СтрокаОписания);	
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
	

КонецФункции // ПечатьАктаДефектации(МассивОбъектов, ПараметрыПечати)

Функция ПечатьРекламационногоАкта(МассивОбъектов, ПараметрыПечати)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_РекламационныйАкт");
	ТабДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	               |	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
	               |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	               |	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
	               |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ОписаниеДефекта,
	               |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ПричинаДефекта,
	               |	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта КАК ПоследствияДефекта,
	               |	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	               |	торо_ВыявленныеДефектыСписокДефектов.ГарантийныйРемонт КАК ГарантийныйРемонт,
	               |	торо_СрокиГарантииОбъектовРемонта.ГарантирующаяОрганизация КАК ГарантирующаяОрганизация,
	               |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ДатаНачалаГарантии КАК ДатаНачалаГарантии,
	               |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ДатаОкончанияГарантии КАК ДатаОкончанияГарантии,
	               |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьПериодГарантии КАК ПроверятьПериодГарантии,
	               |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьНаработку КАК ПроверятьНаработку,
	               |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ЗначениеНаработки КАК ЗначениеНаработки,
	               |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки КАК ПоказательНаработки
	               |ПОМЕСТИТЬ вт_ТаблицаГарантий
	               |ИЗ
	               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СрокиГарантииОбъектовРемонта КАК торо_СрокиГарантииОбъектовРемонта
	               |		ПО торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент = торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта
	               |ГДЕ
	               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	               |	И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_НаработкаОбъектовРемонтаОстатки.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_НаработкаОбъектовРемонтаОстатки.Показатель КАК Показатель,
	               |	торо_НаработкаОбъектовРемонтаОстатки.НаработкаОстаток КАК Наработка
	               |ПОМЕСТИТЬ ТекущаяНаработка
	               |ИЗ
	               |	РегистрНакопления.торо_НаработкаОбъектовРемонта.Остатки(
	               |			&ДатаОбнаружения,
	               |			(ОбъектРемонта, Показатель) В
	               |				(ВЫБРАТЬ
	               |					вт_ТаблицаГарантий.ОтказавшийЭлемент КАК ОбъектРемонта,
	               |					вт_ТаблицаГарантий.ПоказательНаработки
	               |				ИЗ
	               |					вт_ТаблицаГарантий КАК вт_ТаблицаГарантий
	               |				ГДЕ
	               |					вт_ТаблицаГарантий.ПроверятьНаработку)) КАК торо_НаработкаОбъектовРемонтаОстатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Показатель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_ТаблицаГарантий.Ссылка КАК Ссылка,
	               |	вт_ТаблицаГарантий.Ссылка.Организация КАК Организация,
	               |	вт_ТаблицаГарантий.Ссылка.Ответственный КАК Ответственный,
	               |	вт_ТаблицаГарантий.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения,
	               |	вт_ТаблицаГарантий.ВидДефекта КАК ВидДефекта,
	               |	вт_ТаблицаГарантий.ОписаниеДефекта КАК ОписаниеДефекта,
	               |	вт_ТаблицаГарантий.ПричинаДефекта КАК ПричинаДефекта,
	               |	вт_ТаблицаГарантий.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	               |	вт_ТаблицаГарантий.ОтказавшийЭлемент.ЗаводскойНомер КАК ЗаводскойНомерОР,
	               |	вт_ТаблицаГарантий.ГарантийныйРемонт КАК ГарантийныйРемонт,
	               |	вт_ТаблицаГарантий.ГарантирующаяОрганизация КАК ГарантирующаяОрганизация,
	               |	вт_ТаблицаГарантий.ДатаНачалаГарантии КАК ДатаНачалаГарантии,
	               |	вт_ТаблицаГарантий.ДатаОкончанияГарантии КАК ДатаОкончанияГарантии,
	               |	вт_ТаблицаГарантий.ПоследствияДефекта КАК ПоследствияДефекта,
	               |	вт_ТаблицаГарантий.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	               |	NULL КАК ЗначениеНаработки,
	               |	NULL КАК ПоказательНаработки
	               |ИЗ
	               |	вт_ТаблицаГарантий КАК вт_ТаблицаГарантий
	               |ГДЕ
	               |	вт_ТаблицаГарантий.ПроверятьПериодГарантии = ИСТИНА
	               |	И НАЧАЛОПЕРИОДА(вт_ТаблицаГарантий.ДатаНачалаГарантии, ДЕНЬ) <= &ДатаОбнаружения
	               |	И КОНЕЦПЕРИОДА(вт_ТаблицаГарантий.ДатаОкончанияГарантии, ДЕНЬ) >= &ДатаОбнаружения
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	вт_ТаблицаГарантий.Ссылка,
	               |	вт_ТаблицаГарантий.Ссылка.Организация,
	               |	вт_ТаблицаГарантий.Ссылка.Ответственный,
	               |	вт_ТаблицаГарантий.Ссылка.ДатаОбнаружения,
	               |	вт_ТаблицаГарантий.ВидДефекта,
	               |	вт_ТаблицаГарантий.ОписаниеДефекта,
	               |	вт_ТаблицаГарантий.ПричинаДефекта,
	               |	вт_ТаблицаГарантий.ОтказавшийЭлемент,
	               |	вт_ТаблицаГарантий.ОтказавшийЭлемент.ЗаводскойНомер,
	               |	вт_ТаблицаГарантий.ГарантийныйРемонт,
	               |	вт_ТаблицаГарантий.ГарантирующаяОрганизация,
	               |	NULL,
	               |	NULL,
	               |	вт_ТаблицаГарантий.ПоследствияДефекта,
	               |	вт_ТаблицаГарантий.НаправлениеНаУстранение,
	               |	вт_ТаблицаГарантий.ЗначениеНаработки,
	               |	вт_ТаблицаГарантий.ПоказательНаработки
	               |ИЗ
	               |	вт_ТаблицаГарантий КАК вт_ТаблицаГарантий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТекущаяНаработка КАК ТекущаяНаработка
	               |		ПО вт_ТаблицаГарантий.ОтказавшийЭлемент = ТекущаяНаработка.ОбъектРемонта
	               |			И вт_ТаблицаГарантий.ПоказательНаработки = ТекущаяНаработка.Показатель
	               |ГДЕ
	               |	вт_ТаблицаГарантий.ПроверятьНаработку = ИСТИНА
	               |	И вт_ТаблицаГарантий.ПроверятьПериодГарантии = ЛОЖЬ
	               |	И ЕСТЬNULL(ТекущаяНаработка.Наработка, 0) < вт_ТаблицаГарантий.ЗначениеНаработки";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Запрос.УстановитьПараметр("ДатаОбнаружения", МассивОбъектов[0].ДатаОбнаружения);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Организация = Строка(Выборка.Организация);
		ОбластьШапка.Параметры.ДатаДокумента = МассивОбъектов[0].Дата;
		ОбластьШапка.Параметры.Ответственный = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Выборка.Ответственный));
		ТабДокумент.Вывести(ОбластьШапка);
		
		ОбластьДефект = Макет.ПолучитьОбласть("Дефект");
		ЗаполнитьЗначенияСвойств(ОбластьДефект.Параметры, Выборка);
		ОбластьДефект.Параметры.ОрганизацияАдрес = Строка(Выборка.Организация);
		ОбластьДефект.Параметры.ОтказавшийЭлемент = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОтказавшийЭлемент);
		ОбластьДефект.Параметры.ЗаводНомер = СокрЛП(Выборка.ЗаводскойНомерОР);
		Если ЗначениеЗаполнено(Выборка.ДатаОкончанияГарантии) И ЗначениеЗаполнено(Выборка.ДатаНачалаГарантии) Тогда 
			ОбластьДефект.Параметры.ДатаПоступления = Выборка.ДатаНачалаГарантии;
			ОбластьДефект.Параметры.ГарантСрок = Строка((НачалоДня(Выборка.ДатаОкончанияГарантии)-НачалоДня(Выборка.ДатаНачалаГарантии))/86400) + " д.";
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьДефект);
		
		ОбластьПриложение = Макет.ПолучитьОбласть("Приложение");
		ТабДокумент.Вывести(ОбластьПриложение);
		
		ВыборкаКомиссия = ПолучитьКомиссию(Выборка.Ссылка);
		ВывестиКомиссию(ТабДокумент, ВыборкаКомиссия, Макет);
		
		
		ОбластьКомиссия = Макет.ПолучитьОбласть("КомиссияПоставщика");
		ТабДокумент.Вывести(ОбластьКомиссия);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВывестиКомиссию(ТабДокумент, ВыборкаКомиссия, Макет)
	
	ВыборкаКомиссия.Сбросить();
	ОбластьМакетаПредседатель  = Макет.ПолучитьОбласть("ПредседательКомиссии");
	
	ЕстьКомиссия = Ложь;
	
	Если ВыборкаКомиссия.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ОбластьМакетаПредседатель.Параметры, ВыборкаКомиссия);	
		ЕстьКомиссия = Истина;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакетаПредседатель);
	
	ОбластьМакетаЧленыКомиссии = Макет.ПолучитьОбласть("ЧленыКомисии");
	
	Если ЕстьКомиссия Тогда
		
		ВыборкаЧленыКомиссии = ВыборкаКомиссия.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаЧленыКомиссии.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьМакетаЧленыКомиссии.Параметры, ВыборкаЧленыКомиссии);
			ТабДокумент.Вывести(ОбластьМакетаЧленыКомиссии);
			
		КонецЦикла; 
	Иначе
		ТабДокумент.Вывести(ОбластьМакетаЧленыКомиссии);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКомиссию(СсылкаНаДокумент)
	
	    Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_Комиссии.Ссылка КАК Ссылка,
		               |	торо_Комиссии.Председатель КАК ПредседательКомиссии,
		               |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК ДолжностьПредседателя
		               |ПОМЕСТИТЬ втКомиссия
		               |ИЗ
		               |	Справочник.торо_Комиссии КАК торо_Комиссии
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК КадроваяИсторияСотрудниковСрезПоследних
		               |		ПО торо_Комиссии.Председатель = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
		               |ГДЕ
		               |	торо_Комиссии.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втКомиссия.Ссылка КАК Ссылка,
		               |	торо_КомиссииСоставКомиссии.ЧленКомиссии КАК ЧленКомиссии,
					   |    КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность, 
		               |	втКомиссия.ПредседательКомиссии КАК ПредседательКомиссии,
					   |    втКомиссия.ДолжностьПредседателя КАК ДолжностьПредседателя
		               |ИЗ
		               |	втКомиссия КАК втКомиссия
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии.СоставКомиссии КАК торо_КомиссииСоставКомиссии
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК КадроваяИсторияСотрудниковСрезПоследних
		               |			ПО торо_КомиссииСоставКомиссии.ЧленКомиссии = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
		               |		ПО втКомиссия.Ссылка = торо_КомиссииСоставКомиссии.Ссылка
		               |ИТОГИ
		               |	МАКСИМУМ(ПредседательКомиссии),
					   |    МАКСИМУМ(ДолжностьПредседателя)
		               |ПО
		               |	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент.Комиссия);
		Запрос.УстановитьПараметр("Дата", СсылкаНаДокумент.Дата);
		ВыборкаКомиссия = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Возврат ВыборкаКомиссия;

КонецФункции

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("ИзМобильного");
	Реквизиты.Добавить("СтатусДокумента");
	Реквизиты.Добавить("ИсторияСтатусов.*");
	Реквизиты.Добавить("Согласующие.*");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
